package main

import "fmt"

func main() {
	//按位(二进制位)与或
	fmt.Println(5 & 2) //二进制两个为1才为一
	//5二进制 101->101->000
	//2二进制 10->010->000
	//000的十进制为1
	fmt.Println(2 | 5) //二进制一个为1就是1
	//101->101->111
	//10->010->111
	//111的十进制为7

	fmt.Println(2 ^ 5) //二进制位进行异或不同为1否则0
	//101->101->111
	//10->010->111
	//111的十进制为7

	fmt.Println(5 << 1) //将二进制左移n位
	//101->1010
	//1010的十进制为10

	fmt.Println(5 >> 1) //将二进制右移n位
	//101->10
	//10的十进制为2

	//11111111的十进制为255
	//ip 255.255.255.255
	// r  w	 x
	// 1  1  1  ->111的十进制为7
	//读 写 可执行
	//root group   user
	//7    	7       7
	//rwx 111 7
	//rw- 110 6
	//r-x 101 5
	//r-- 100 4
	//-wx 011 3
	//-w- 010 2
	//--x 001 1
	//--- 000 0

}
